<template>
  <div class="about">
    <h1 class="about__title">Обо мне</h1>
    <div class="">
      <p class="about__text">Привет, меня зовут Коля, и я разработчик с немаленьким опытом! Весь мой путь начался с html и css, изучаемых на курсах Михаила Русакова – помнишь, там был ещё html 4. Но это дело прошлого, давай о чем-то интереснее! </p>
      <p class="about__text">Моя любовь к компьютерам и обучению зародилась задолго до этого, когда я, будучи трехлетним чудаком, случайно сломал домашний компьютер. С тех пор я неустанно учусь и получаю новые навыки. Еще в младших классах я без проблем настраивал проектор для учителей и даже удалял программы через диспетчер задач. В четвертом классе я самостоятельно изучил html и css по бесплатным урокам от Михаила Русакова. </p>
      <p class="about__text">Потом я задумался о том, чтобы создать свой сервер в Minecraft, но денег на оплату хостинга у меня не было. В итоге, благодаря видео на YouTube, я настроил сервер на VDS и начал изучать Wordpress и работу с ним. После этого я узнал, что на VDS можно запускать сайты с использованием Nginx и PHP – и я полностью погрузился в изучение этих технологий в восьмом классе. </p>
      <p class="about__text">Когда я учился в девятом классе, я понял, что школьная программа и изучение JavaScript не вдохновляют меня, и я принял решение поступить в техникум на специальность веб-разработчика. Однако, разочарование пришло очень быстро – там много неопытных людей, и иногда приходится справляться с проблемами в одиночку. </p>
      <p class="about__text">На втором курсе ко мне в группу пришел мой нынешний друг, который рассказал о своей задумке создать бесплатную социальную сеть. Начали она на PHP, но теперь мы разрабатываем ее дальше, уже без использования PHP. Дизайн проекта несколько раз менялся, есть готовый UI-кит, а фронтенд теперь работает на React, а бэкенд – на Go с использованием различных технологий.</p>
      <p class="about__text">Вот такой интересный и запутанный путь лежит за моими плечами, и я ни на секунду не сожалею о пройденном. Учиться и развиваться – моя страсть, и я готов делиться своим опытом со всеми, кто готов идти по этому увлекательному пути!</p>
    </div>
    <div class="about__image"></div>
  </div>
</template>

<style>
  .about{
    padding: 17px 116px 20px 120px;
  }
</style>
